In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "Name" : ['harry','yash','shubh'],
    "Marks": ['92','99','89'],
    "City" : ['pune','jalna','bareli']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

    Name Marks    City
0  harry    92    pune
1   yash    99   jalna
2  shubh    89  bareli

In [5]:
df.to_csv('friends_csv')

In [6]:
df.to_csv('friends_csv',index = False)

In [7]:
df.head(2)

    Name Marks   City
0  harry    92   pune
1   yash    99  jalna

In [8]:
df.tail(2)

    Name Marks    City
1   yash    99   jalna
2  shubh    89  bareli

In [9]:
df.describe()

         Name Marks  City
count       3     3     3
unique      3     3     3
top     harry    92  pune
freq        1     1     1

In [10]:
yash = pd.read_csv('yash.csv')

In [11]:
yash

   Train No  Speed    City
0     22021     92    pune
1     10229     99   jalna
2     10110     89  bareli
3     29901     25     goa

In [12]:
yash['Speed']

0    92
1    99
2    89
3    25
Name: Speed, dtype: int64

In [13]:
yash['Speed'][1]=30

C:\Users\Yash Amte\AppData\Local\Temp\ipykernel_15124\2601576342.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  yash['Speed'][1]=30

In [14]:
yash

   Train No  Speed    City
0     22021     92    pune
1     10229     30   jalna
2     10110     89  bareli
3     29901     25     goa

In [17]:
yash.to_csv('yash.csv', index= False)

In [21]:
yash.index =  ['first','second','third','fourth']

In [22]:
yash

        Train No  Speed    City
first      22021     92    pune
second     10229     30   jalna
third      10110     89  bareli
fourth     29901     25     goa

In [23]:
ser = pd.Series(np.random.rand(30))

In [26]:
type(ser)

pandas.core.series.Series

In [27]:
newdf = pd.DataFrame(np.random.rand(334,5), index= np.arange(334))

In [31]:
type(newdf)

pandas.core.frame.DataFrame

In [32]:
 newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [33]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.495303    0.496201    0.484337    0.507965    0.506722
std      0.276152    0.291145    0.284997    0.277447    0.289827
min      0.004644    0.000664    0.002882    0.000866    0.000255
25%      0.266689    0.245834    0.231999    0.282634    0.267047
50%      0.491252    0.516760    0.484219    0.497577    0.495811
75%      0.709811    0.748695    0.728406    0.752157    0.752502
max      0.998461    0.997906    0.999375    0.997844    0.999072

In [34]:
newdf[0][0]="yash"

C:\Users\Yash Amte\AppData\Local\Temp\ipykernel_15124\950103642.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]="yash"
C:\Users\Yash Amte\AppData\Local\Temp\ipykernel_15124\950103642.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'yash' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="yash"

In [35]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [36]:
newdf.head()

          0         1         2         3         4
0      yash  0.219524  0.002882  0.710514  0.407711
1  0.143675  0.615523  0.244159  0.341380  0.790694
2   0.82784  0.525134  0.182414  0.293977  0.926221
3  0.710211  0.909408  0.729414  0.112800  0.266637
4  0.652161  0.110380  0.037358  0.717515  0.000255

In [37]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [38]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [42]:
newdf[0][0]=0.2

In [43]:
newdf.to_numpy()

array([[0.2, 0.21952361457937797, 0.0028815568606055386,
        0.710514272589841, 0.4077111132351674],
       [0.14367496693638582, 0.615522640583293, 0.2441587230455292,
        0.3413803675211232, 0.7906936311491051],
       [0.8278400513566654, 0.5251339001034097, 0.18241445432678716,
        0.2939766463008934, 0.9262208039572667],
       ...,
       [0.24923024267235183, 0.8412506907530385, 0.9503305794989108,
        0.3268419426549174, 0.753995090483581],
       [0.03396115079097384, 0.4614849323884168, 0.4748433252374332,
        0.9560629118972462, 0.11670054895835658],
       [0.14906354696238577, 0.5610631030072002, 0.45141426471291757,
        0.2407647879309498, 0.32697657467251473]],
      shape=(334, 5), dtype=object)

In [44]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.2,0.143675,0.82784,0.710211,0.652161,0.549044,0.839405,0.074911,0.505773,0.195546,...,0.585253,0.484501,0.678325,0.382775,0.394096,0.747735,0.481818,0.24923,0.033961,0.149064
1,0.219524,0.615523,0.525134,0.909408,0.11038,0.596553,0.697029,0.993149,0.965148,0.335494,...,0.23074,0.042598,0.266629,0.608864,0.371725,0.701162,0.569404,0.841251,0.461485,0.561063
2,0.002882,0.244159,0.182414,0.729414,0.037358,0.023861,0.710909,0.420108,0.560005,0.344303,...,0.81098,0.333036,0.063399,0.950683,0.452389,0.453236,0.151002,0.950331,0.474843,0.451414
3,0.710514,0.34138,0.293977,0.1128,0.717515,0.292646,0.452631,0.496633,0.098464,0.374222,...,0.613912,0.532244,0.914818,0.617249,0.476489,0.219983,0.107995,0.326842,0.956063,0.240765
4,0.407711,0.790694,0.926221,0.266637,0.000255,0.274751,0.795395,0.416355,0.884406,0.44073,...,0.71548,0.793016,0.440023,0.969074,0.816122,0.610307,0.522658,0.753995,0.116701,0.326977

In [45]:
newdf.head()

          0         1         2         3         4
0       0.2  0.219524  0.002882  0.710514  0.407711
1  0.143675  0.615523  0.244159  0.341380  0.790694
2   0.82784  0.525134  0.182414  0.293977  0.926221
3  0.710211  0.909408  0.729414  0.112800  0.266637
4  0.652161  0.110380  0.037358  0.717515  0.000255

In [48]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.149064  0.561063  0.451414  0.240765  0.326977
332  0.033961  0.461485  0.474843  0.956063  0.116701
331   0.24923  0.841251  0.950331  0.326842  0.753995
330  0.481818  0.569404  0.151002  0.107995  0.522658
329  0.747735  0.701162  0.453236  0.219983  0.610307
..        ...       ...       ...       ...       ...
4    0.652161  0.110380  0.037358  0.717515  0.000255
3    0.710211  0.909408  0.729414  0.112800  0.266637
2     0.82784  0.525134  0.182414  0.293977  0.926221
1    0.143675  0.615523  0.244159  0.341380  0.790694
0         0.2  0.219524  0.002882  0.710514  0.407711

[334 rows x 5 columns]

In [49]:
type(newdf[0])

pandas.core.series.Series

In [50]:
type(newdf)

pandas.core.frame.DataFrame

In [51]:
newdf2=newdf

In [52]:
newdf2[0][0]=9210

In [53]:
newdf

            0         1         2         3         4
0        9210  0.219524  0.002882  0.710514  0.407711
1    0.143675  0.615523  0.244159  0.341380  0.790694
2     0.82784  0.525134  0.182414  0.293977  0.926221
3    0.710211  0.909408  0.729414  0.112800  0.266637
4    0.652161  0.110380  0.037358  0.717515  0.000255
..        ...       ...       ...       ...       ...
329  0.747735  0.701162  0.453236  0.219983  0.610307
330  0.481818  0.569404  0.151002  0.107995  0.522658
331   0.24923  0.841251  0.950331  0.326842  0.753995
332  0.033961  0.461485  0.474843  0.956063  0.116701
333  0.149064  0.561063  0.451414  0.240765  0.326977

[334 rows x 5 columns]

In [54]:
newdf3=newdf.copy()

In [55]:
newdf3[0][0]=1111

C:\Users\Yash Amte\AppData\Local\Temp\ipykernel_15124\568395550.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf3[0][0]=1111
C:\Users\Yash Amte\AppData\Local\Temp\ipykernel_15124\568395550.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[0][0]=1111

In [56]:
newdf

            0         1         2         3         4
0        9210  0.219524  0.002882  0.710514  0.407711
1    0.143675  0.615523  0.244159  0.341380  0.790694
2     0.82784  0.525134  0.182414  0.293977  0.926221
3    0.710211  0.909408  0.729414  0.112800  0.266637
4    0.652161  0.110380  0.037358  0.717515  0.000255
..        ...       ...       ...       ...       ...
329  0.747735  0.701162  0.453236  0.219983  0.610307
330  0.481818  0.569404  0.151002  0.107995  0.522658
331   0.24923  0.841251  0.950331  0.326842  0.753995
332  0.033961  0.461485  0.474843  0.956063  0.116701
333  0.149064  0.561063  0.451414  0.240765  0.326977

[334 rows x 5 columns]

In [57]:
newdf.columns = list("abcde")

In [58]:
newdf

            a         b         c         d         e
0        9210  0.219524  0.002882  0.710514  0.407711
1    0.143675  0.615523  0.244159  0.341380  0.790694
2     0.82784  0.525134  0.182414  0.293977  0.926221
3    0.710211  0.909408  0.729414  0.112800  0.266637
4    0.652161  0.110380  0.037358  0.717515  0.000255
..        ...       ...       ...       ...       ...
329  0.747735  0.701162  0.453236  0.219983  0.610307
330  0.481818  0.569404  0.151002  0.107995  0.522658
331   0.24923  0.841251  0.950331  0.326842  0.753995
332  0.033961  0.461485  0.474843  0.956063  0.116701
333  0.149064  0.561063  0.451414  0.240765  0.326977

[334 rows x 5 columns]

In [65]:
newdf.loc[0,0]=20

In [66]:
newdf

            a         b         c         d         e     0
0          20  0.219524  0.002882  0.710514  0.407711  20.0
1    0.143675  0.615523  0.244159  0.341380  0.790694   NaN
2     0.82784  0.525134  0.182414  0.293977  0.926221   NaN
3    0.710211  0.909408  0.729414  0.112800  0.266637   NaN
4    0.652161  0.110380  0.037358  0.717515  0.000255   NaN
..        ...       ...       ...       ...       ...   ...
329  0.747735  0.701162  0.453236  0.219983  0.610307   NaN
330  0.481818  0.569404  0.151002  0.107995  0.522658   NaN
331   0.24923  0.841251  0.950331  0.326842  0.753995   NaN
332  0.033961  0.461485  0.474843  0.956063  0.116701   NaN
333  0.149064  0.561063  0.451414  0.240765  0.326977   NaN

[334 rows x 6 columns]

In [70]:
newdf = newdf.drop(0,axis=1)

In [71]:
newdf

            a         b         c         d         e
0          20  0.219524  0.002882  0.710514  0.407711
1    0.143675  0.615523  0.244159  0.341380  0.790694
2     0.82784  0.525134  0.182414  0.293977  0.926221
3    0.710211  0.909408  0.729414  0.112800  0.266637
4    0.652161  0.110380  0.037358  0.717515  0.000255
..        ...       ...       ...       ...       ...
329  0.747735  0.701162  0.453236  0.219983  0.610307
330  0.481818  0.569404  0.151002  0.107995  0.522658
331   0.24923  0.841251  0.950331  0.326842  0.753995
332  0.033961  0.461485  0.474843  0.956063  0.116701
333  0.149064  0.561063  0.451414  0.240765  0.326977

[334 rows x 5 columns]

In [73]:
newdf.loc[[1,2],['a','b']]

          a         b
1  0.143675  0.615523
2   0.82784  0.525134

In [74]:
newdf.head()

          a         b         c         d         e
0        20  0.219524  0.002882  0.710514  0.407711
1  0.143675  0.615523  0.244159  0.341380  0.790694
2   0.82784  0.525134  0.182414  0.293977  0.926221
3  0.710211  0.909408  0.729414  0.112800  0.266637
4  0.652161  0.110380  0.037358  0.717515  0.000255

In [75]:
newdf.loc[:,['a','b']]

            a         b
0          20  0.219524
1    0.143675  0.615523
2     0.82784  0.525134
3    0.710211  0.909408
4    0.652161  0.110380
..        ...       ...
329  0.747735  0.701162
330  0.481818  0.569404
331   0.24923  0.841251
332  0.033961  0.461485
333  0.149064  0.561063

[334 rows x 2 columns]

In [77]:
newdf.loc[[1,2],:]

          a         b         c         d         e
1  0.143675  0.615523  0.244159  0.341380  0.790694
2   0.82784  0.525134  0.182414  0.293977  0.926221

In [78]:
newdf.loc[(newdf['a']<0.3)]

            a         b         c         d         e
1    0.143675  0.615523  0.244159  0.341380  0.790694
7    0.074911  0.993149  0.420108  0.496633  0.416355
9    0.195546  0.335494  0.344303  0.374222  0.440730
11    0.15676  0.894538  0.039367  0.459071  0.672805
13   0.026241  0.168771  0.055656  0.493583  0.401930
..        ...       ...       ...       ...       ...
320  0.098742  0.866110  0.158160  0.008959  0.056766
323  0.217169  0.193089  0.167897  0.322099  0.096317
331   0.24923  0.841251  0.950331  0.326842  0.753995
332  0.033961  0.461485  0.474843  0.956063  0.116701
333  0.149064  0.561063  0.451414  0.240765  0.326977

[90 rows x 5 columns]

In [84]:
newdf.loc[(newdf['a']<0.3) & (newdf['c']>0.8)]

            a         b         c         d         e
28   0.225212  0.035814  0.924077  0.569145  0.422548
38   0.121253  0.109589  0.898311  0.474467  0.895774
63   0.069285  0.638741  0.994700  0.269039  0.850966
74   0.297785  0.412008  0.827457  0.397010  0.626357
81   0.133098  0.038063  0.910043  0.267245  0.951591
92   0.221554  0.275112  0.902907  0.821772  0.169470
106  0.050827  0.528191  0.962711  0.747829  0.477645
141  0.160235  0.100508  0.892737  0.544833  0.477054
176  0.228411  0.904396  0.922772  0.890703  0.568786
193  0.270751  0.541101  0.824334  0.193036  0.082171
198  0.265246  0.481986  0.857205  0.352805  0.377720
290  0.170447  0.993456  0.811635  0.786071  0.532435
331   0.24923  0.841251  0.950331  0.326842  0.753995